export default function About() {
    return(
        <>
            <div className="rules">
            Вибір серед багатьох. Опис гри та правила
            <br/>            
            Мета гри:
                Гравець отримує певну тему.
                Серед багатьох зображень, що з'являються на екрані, гравець повинен вибрати ті, які відносяться до заданої теми.
            <br/>
            Структура гри:
                На екрані відображається набір зображень, наприклад, 9 картинок.
                З цих зображень тільки частина (наприклад, 3) підходить під задану тему.
            <br/>
            Процес гри:
                Гравець отримує завдання з темою і бачить перед собою всі зображення.
                Завдання полягає в тому, щоб якомога швидше і точніше обрати всі зображення, що відповідають темі.
                Гравець натискає на ті зображення, які, на його думку, підходять.
            <br/>
            Оцінка результатів:
                Гравець отримує очки за правильні відповіді.
                Результат набраний користувачем відображається в кінці гри.
            </div>
            <div className="rules">
            Колесо Епох. Опис гри та правила.
            <br/>
            Структура гри:
                Є визначена тема, предмети якої треба вибрати.
                Є одна горизонтальна стрічка з секторами, на яких зображені різні елементи різної тематики
                Стрічка автоматично починає обертатися або рухатися після початку гри.
            <br/>
            Мета гри:
                Гравець повинен натиснути кнопку, щоб зупинити обертання стрічки в потрібний момент, намагаючись, щоб індикатор вказував на бажаний сектор.
            <br/>
            Процес гри:
                Перед початком гри визначається тема, предмет з якої треба обрати на стрічці.
                Після початку гри колесо або стрічка починають швидко обертатися.
                Гравець спостерігає за обертанням і натискає кнопку у той момент, коли вважає, що стрілка зупиниться на виграшному секторі.
                Зупинка стрічки відбувається миттєво.
            <br/>
            Оцінка результатів:
                Гравець отримує зазначену винагороду в залежності від того чи була обрана правильна відповідь, яка була вказана.
                Результат набраний користувачем відображається в кінці гри.
            </div>
            <a href="/">Назад</a>
        </>
    )
}