export default function About() {
    return(
        <section style={{ backgroundColor: "var(--background-color)", display: "flex", position: "absolute", height: "100svh", top: "0" }}>
            <div className="rules">
            Вибір серед багатьох. Опис гри та правила
            <br/>            
            Мета гри:
            <ul>
                <li>Гравець отримує певну тему.</li>
                <li>Серед багатьох зображень, що з'являються на екрані, гравець повинен вибрати ті, які відносяться до заданої теми.</li>
            </ul>
            <br/>
            Структура гри:
            <ul>
                <li>На екрані відображається набір зображень, наприклад, 9 картинок.</li>
                <li>З цих зображень тільки частина (наприклад, 3) підходить під задану тему.</li>
            </ul>
            <br/>
            Процес гри:
            <ul>
                <li>Гравець отримує завдання з темою і бачить перед собою всі зображення.</li>
                <li>Завдання полягає в тому, щоб якомога швидше і точніше обрати всі зображення, що відповідають темі.</li>
                <li>Гравець натискає на ті зображення, які, на його думку, підходять.</li>
            </ul>
            <br/>
            Оцінка результатів:
            <ul>
                <li>Гравець отримує очки за правильні відповіді.</li>
                <li>Результат набраний користувачем відображається в кінці гри.</li>
            </ul>
            </div>
            <div className="rules">
                Колесо Епох. Опис гри та правила.
                <br/>
                Структура гри:
                <ul>
                    <li>Є визначена тема, предмети якої треба вибрати.</li>
                    <li>Є одна горизонтальна стрічка з секторами, на яких зображені різні елементи різної тематики</li>
                    <li>Стрічка автоматично починає обертатися або рухатися після початку гри.</li>
                </ul>

                <br/>
                Мета гри:
                <ul>
                    <li>Гравець повинен натиснути кнопку, щоб зупинити обертання стрічки в потрібний момент, намагаючись, щоб індикатор вказував на бажаний сектор.</li>
                </ul>
                <br/>
                Процес гри:
                <ul>
                    <li>Перед початком гри визначається тема, предмет з якої треба обрати на стрічці.</li>
                    <li>Після початку гри колесо або стрічка починають швидко обертатися.</li>
                    <li>Гравець спостерігає за обертанням і натискає кнопку у той момент, коли вважає, що стрілка зупиниться на виграшному секторі.</li>
                    <li>Зупинка стрічки відбувається миттєво.</li>
                </ul>
                <br/>
                Оцінка результатів:
                <ul>
                    <li>Гравець отримує зазначену винагороду в залежності від того чи була обрана правильна відповідь, яка була вказана.</li>
                    <li>Результат набраний користувачем відображається в кінці гри.</li>
                </ul>
            </div>
            <a href="/" style={{position: "absolute", bottom: "0", left: "0"}}>Назад</a>
        </section>
    )
}